In [1]:
 # Dependencies
import numpy as np
import requests
import tabula #read talbes in PDFs
import pandas as pd
from sqlalchemy import create_engine

## Ohio income tax by county

In [2]:
# Read remote PDF into list of DataFrames
# Individual Income Tax: Taxable Year 2018 IT-1040 Returns, by County
tax_ohio_url="https://tax.ohio.gov/static/communications/publications/annual_reports/2020annualreport.pdf"
income_tax_page_num=165
income_tax_table= tabula.read_pdf(tax_ohio_url,pages=income_tax_page_num)

In [3]:
# choose the first dataframe in the table list
income_pdf_df=income_tax_table[0]

#change display option on columen width and display the dataframe
pd.set_option('display.max_colwidth', None)
income_pdf_df

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,Table 21,NaN,NaN,NaN,NaN
1,"Individual Income Tax: Taxable Year 2018 IT-1040 Returns, by County",NaN,NaN,NaN,NaN
2,Number of Federal Adjusted Ohio Income Tax,Number of,NaN,Federal Adjusted,Ohio Income Tax
3,County Returns Gross Income Liability County,Returns,NaN,Gross Income,Liability
4,"Adams 10,801 $510,636,078 $9,137,991 Lucas","192,188",$,"11,495,307,630","$253,783,325"
5,"Allen 47,553 $2,652,560,940 $53,819,629 Madison","19,265",$,"1,239,937,113","$26,196,454"
6,"Ashland 24,343 $1,283,000,065 $24,930,240 Mahoning","105,957",$,"5,954,785,375","$121,834,737"
7,"Ashtabula 42,985 $2,059,532,429 $38,304,615 Marion","26,974",$,"1,322,750,746","$24,802,115"
8,"Athens 22,539 $1,167,323,875 $23,709,431 Medina","91,606",$,"6,924,402,532","$163,550,630"
9,"Auglaize 22,427 $1,371,905,585 $29,294,222 Meigs","8,936",$,"418,893,584","$7,759,649"
10,"Belmont 29,747 $1,896,494,906 $41,232,525 Mercer","20,933",$,"1,280,279,676","$24,798,725"
11,"Brown 18,440 $902,589,595 $17,161,804 Miami","50,960",$,"3,230,091,344","$69,680,297"
12,"Butler 173,475 $11,676,173,183 $268,656,135 Monroe","6,427",$,"439,921,841","$8,622,658"
13,"Carroll 12,283 $656,399,831 $12,275,100 Montgomery","244,034",$,"14,691,350,312","$316,257,173"
14,"Champaign 17,611 $929,583,463 $18,430,144 Morgan","5,682",$,"257,250,128","$4,845,868"
15,"Clark 60,335 $3,135,528,157 $60,419,493 Morrow","15,340",$,"812,130,412","$15,953,992"
16,"Clermont 96,440 $6,667,430,361 $155,233,066 Muskingum","38,897",$,"1,984,480,142","$39,798,218"
17,"Clinton 19,594 $1,168,645,817 $23,909,313 Noble","5,460",$,"300,863,842","$6,005,571"
18,"Columbiana 45,546 $2,266,270,831 $43,547,070 Ottawa","21,153",$,"1,328,339,973","$27,499,739"
19,"Coshocton 15,835 $727,512,010 $12,934,256 Paulding","8,789",$,"431,919,099","$7,692,257"
20,"Crawford 19,921 $917,343,866 $16,377,522 Perry","14,805",$,"733,964,876","$14,394,147"
21,"Cuyahoga 588,592 $41,682,628,533 $994,221,116 Pickaway","24,560",$,"1,445,927,155","$30,476,384"
22,"Darke 24,483 $1,291,264,967 $24,199,066 Pike","11,459",$,"555,213,848","$10,663,669"
23,"Defiance 18,707 $1,030,049,755 $19,890,381 Portage","74,491",$,"4,607,266,567","$101,416,917"
24,"Delaware 96,796 $11,014,383,555 $302,944,195 Preble","18,027",$,"916,052,021","$17,153,144"
25,"Erie 37,611 $2,160,497,505 $44,740,058 Putnam","17,004",$,"1,067,675,822","$21,754,574"
26,"Fairfield 70,229 $4,588,320,011 $101,402,499 Richland","55,629",$,"2,811,494,135","$54,096,483"
27,"Fayette 12,947 $615,996,252 $11,091,902 Ross","32,183",$,"1,719,231,716","$35,528,346"
28,"Franklin 615,402 $42,799,466,758 $1,032,082,493 Sandusky","28,964",$,"1,484,158,645","$28,405,683"
29,"Fulton 20,921 $1,199,284,802 $23,701,111 Scioto","26,979",$,"1,411,958,129","$29,007,220"
30,"Gallia 11,560 $630,196,554 $13,209,529 Seneca","26,037",$,"1,291,693,835","$24,210,431"
31,"Geauga 46,054 $4,921,393,832 $129,305,133 Shelby","23,852",$,"1,355,987,107","$27,888,988"
32,"Greene 74,870 $5,562,700,189 $123,168,488 Stark","178,877",$,"10,477,729,260","$221,481,486"
33,"Guernsey 17,547 $934,869,283 $18,680,750 Summit","260,290",$,"17,712,112,931","$414,021,346"
34,"Hamilton 387,435 $31,736,069,334 $813,293,328 Trumbull","95,586",$,"4,789,268,443","$89,523,053"
35,"Hancock 36,259 $2,486,365,831 $58,490,391 Tuscarawas","43,560",$,"2,460,783,573","$47,702,079"
36,"Hardin 13,116 $629,800,214 $11,821,452 Union","26,067",$,"2,074,636,950","$50,940,952"
37,"Harrison 6,399 $358,122,046 $6,867,440 Van Wert","13,740",$,"742,610,273","$14,779,268"
38,"Henry 13,690 $785,318,092 $15,511,138 Vinton","4,529",$,"205,256,301","$3,780,373"
39,"Highland 17,606 $833,987,122 $15,017,162 Warren","109,647",$,"10,151,589,568","$267,198,261"
40,"Hocking 12,097 $590,201,822 $11,130,569 Washington","27,418",$,"1,559,357,770","$31,323,545"
41,"Holmes 17,241 $945,595,245 $15,793,231 Wayne","52,909",$,"3,067,494,468","$60,785,462"
42,"Huron 28,499 $1,475,757,138 $28,445,592 Williams","17,991",$,"910,232,809","$17,207,810"
43,"Jackson 13,188 $597,643,791 $11,577,249 Wood","61,628",$,"4,210,163,558","$95,595,090"
44,"Jefferson 28,818 $1,559,984,668 $30,907,470 Wyandot","10,894",$,"586,259,974","$11,114,002"
45,"Knox 26,886 $1,543,777,216 $32,053,996",NaN,NaN,NaN,NaN
46,"Lake 120,375 $7,786,468,974 $173,948,346 County Total","5,431,908","$ 357,094,112,610",NaN,"$8,120,878,171"
47,"Lawrence 24,275 $1,223,611,544 $23,624,510",NaN,NaN,NaN,NaN
48,"Licking 80,701 $5,135,659,799 $112,910,952 Other 1","230,530",$,"138,731,593,659","$282,944,915"
49,"Logan 22,393 $1,243,184,207 $25,267,342",NaN,NaN,NaN,NaN
50,"Lorain 147,609 $9,281,759,096 $206,678,605 State Total","5,662,438","$ 495,825,706,269",NaN,"$8,403,823,086"

In [4]:
#change column names
income_pdf_df.columns = income_pdf_df.iloc[2]+" "+income_pdf_df.iloc[3]

# remove unncessary headings  
income_pdf_df=income_pdf_df.drop([0,1,2,3])

# fill the nan column name with "Dollar"
income_pdf_df.columns = income_pdf_df.columns.fillna('Dollar')

#remove the dollar sign with in the content
income_pdf_df=income_pdf_df.replace('\$','',regex=True)
income_pdf_df=income_pdf_df.replace('\,','',regex=True)

# the dataframe after the above process
income_pdf_df.head()

,Number of Federal Adjusted Ohio Income Tax County Returns Gross Income Liability County,Number of Returns,Dollar,Federal Adjusted Gross Income,Ohio Income Tax Liability
4,Adams 10801 510636078 9137991 Lucas,192188,,11495307630,253783325
5,Allen 47553 2652560940 53819629 Madison,19265,,1239937113,26196454
6,Ashland 24343 1283000065 24930240 Mahoning,105957,,5954785375,121834737
7,Ashtabula 42985 2059532429 38304615 Marion,26974,,1322750746,24802115
8,Athens 22539 1167323875 23709431 Medina,91606,,6924402532,163550630

In [5]:
# prepare a data frame to split column values
income_pdf_split=income_pdf_df.rename(columns={'Number of  Federal Adjusted  Ohio Income Tax County Returns Gross Income Liability County':'County'}).copy()

# split the first column content with "space" 
income_left_df = income_pdf_split['County'].str.split(" ", expand=True)
income_left_df.head()

           0      1 2           3 4         5         6     7
4      Adams  10801     510636078     9137991     Lucas  None
5      Allen  47553    2652560940    53819629   Madison  None
6    Ashland  24343    1283000065    24930240  Mahoning  None
7  Ashtabula  42985    2059532429    38304615    Marion  None
8     Athens  22539    1167323875    23709431    Medina  None

In [6]:
# drop columns that have no values
income_left_df=income_left_df.drop([2,4], axis=1)

# replace nan values with "space"
income_left_df=income_left_df.replace(np.nan, ' ', regex=True)

# rename the columns
income_left_df.rename(columns={0:"county_name",
                              1:"num_of_returns",
                               3:"fed_agi",
                              5:"oh_income_tax_liability"},inplace=True)
# the first half of the dataframe is cleaned as shown below
income_left_df.head()

  county_name num_of_returns     fed_agi oh_income_tax_liability         6  7
4       Adams          10801   510636078                 9137991     Lucas
5       Allen          47553  2652560940                53819629   Madison
6     Ashland          24343  1283000065                24930240  Mahoning
7   Ashtabula          42985  2059532429                38304615    Marion
8      Athens          22539  1167323875                23709431    Medina

In [7]:
# drop the first column to get the second half of the dataframe
income_right_df=income_pdf_split.drop(["County"], axis=1)

# add the county_name column from the values from incom_left_df
income_right_df["county_name"]=income_left_df[6]+income_left_df[7]

# join "Dollar" and "Federal Adjusted Gross Income" and rename it to "fed_agi"
income_right_df["fed_agi"]=income_right_df["Dollar"]+income_right_df["Federal Adjusted Gross Income"]

# rename the columns
income_right_df.rename(columns={"Number of Returns":"num_of_returns",
                               "Ohio Income Tax Liability":"oh_income_tax_liability"},inplace=True)

# remove the rows which have no value from the second dataframe
income_right_df.dropna(thresh=3,inplace=True)
# the second half of the dataframe is cleaned as shown below
income_right_df.head()

,num_of_returns,Dollar,Federal Adjusted Gross Income,oh_income_tax_liability,county_name,fed_agi
4,192188,,11495307630,253783325,Lucas,11495307630
5,19265,,1239937113,26196454,Madison,1239937113
6,105957,,5954785375,121834737,Mahoning,5954785375
7,26974,,1322750746,24802115,Marion,1322750746
8,91606,,6924402532,163550630,Medina,6924402532

In [8]:
# choose the desired columnes from the first and second half dataframes
income_top_df=income_left_df[["county_name","num_of_returns","fed_agi","oh_income_tax_liability"]].copy()
income_bottom_df=income_right_df[["county_name","num_of_returns","fed_agi","oh_income_tax_liability"]].copy()

# concat the two halves into one dataframe based on column names and reset the index
income_tax_df=pd.concat([income_top_df,income_bottom_df]).reset_index(drop=True)

# change datatype to numeric
income_tax_df [["num_of_returns","fed_agi","oh_income_tax_liability"]] =income_tax_df[["num_of_returns","fed_agi","oh_income_tax_liability"]].apply(pd.to_numeric)

# the income_tax_df is read to be loaded into a database
income_tax_df

    county_name  num_of_returns       fed_agi  oh_income_tax_liability
0         Adams           10801  5.106361e+08                  9137991
1         Allen           47553  2.652561e+09                 53819629
2       Ashland           24343  1.283000e+09                 24930240
3     Ashtabula           42985  2.059532e+09                 38304615
4        Athens           22539  1.167324e+09                 23709431
..          ...             ...           ...                      ...
86        Wood            61628  4.210164e+09                 95595090
87     Wyandot            10894  5.862600e+08                 11114002
88  CountyTotal         5431908           NaN               8120878171
89       Other1          230530  1.387316e+11                282944915
90   StateTotal         5662438           NaN               8403823086

[91 rows x 4 columns]

In [ ]:
# Create database connection
# change the owner name, password and port number based on your local situation
# engine = create_engine(f'postgresql://{*database_owner}:{*password}@localhost:{*port}/housing_db')
rds_connection_string = "postgres:postgres@localhost:5433/housing_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [10]:
# Confirm tables
engine.table_names()

<ipython-input-10-df1946b2803a>:5: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['census', 'schools', 'income_tax']

In [12]:
# Load dataframes into databases
income_tax_df.to_sql(name = 'income_tax', con = engine, if_exists = 'append', index = False)

In [13]:
# Confirm data has been added by querying the income_tax table
pd.read_sql_query('select * from income_tax', con=engine).head()

  county_name  num_of_returns       fed_agi  oh_income_tax_liability
0       Adams         10801.0  5.106361e+08                9137991.0
1       Allen         47553.0  2.652561e+09               53819629.0
2     Ashland         24343.0  1.283000e+09               24930240.0
3   Ashtabula         42985.0  2.059532e+09               38304615.0
4      Athens         22539.0  1.167324e+09               23709431.0